import { Injectable, signal, WritableSignal } from '@angular/core';
import { Message } from '@types';

@Injectable({
  providedIn: 'root',
})
export class ScreenNotificationService {
  private messages: WritableSignal<Message[]> = signal([
    // {
    //   title: 'Дуже важливе повідомлення',
    //   text: 'текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст ',
    //   secondaryText: 'текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст ',
    //   buttonText: 'текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст ',
    // },
    // {
    //   title: 'Дуже важливе повідомлення 2',
    //   text: 'текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст ',
    //   secondaryText: 'текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст ',
    //   buttonText: 'текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст ',
    // },
    // {
    //   title: 'Дуже важливе повідомлення 3',
    //   text: 'текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст ',
    //   secondaryText: 'текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст ',
    //   buttonText: 'текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст ',
    // },
  ]);

  public sendMessage(message: Message) {
    this.messages.set([...this.messages(), message]);
  }
  public getMessage(): Message | null {
    return this.messages()[0] || null;
  }

  public removeMessage() {
    this.messages.set(this.messages().slice(1));
  }
}
